from PyQt5 import QtCore, QtGui, QtWidgets
import sys
from tesa import Ui_Dialog

app = QtWidgets.QApplication(sys.argv)

Dialog = QtWidgets.QDialog()
ui = Ui_Dialog()
ui.setupUi(Dialog)
Dialog.show()


def bp():
    ui.textEdit.setText("1 'a' синф ўқувчилари тўғрисида маълумот.\n\n"
                        "1. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "3. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "4. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "5. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "6. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n")



ui.pushButton_3.clicked.connect(bp)

def bp():
    ui.textEdit.setText("1 'б' синф ўқувчилари тўғрисида маълумот.\n\n"
                        "1. Дониёрова Салима Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "3. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "4. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "5. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "6. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n")


ui.pushButton_2.clicked.connect(bp)

def bp():
    ui.textEdit.setText("1 'а' синф рахбари.\n\n"   
                        "1. Хасанова Салима Абдуллаевна. Туғилган йили 1988 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n1 'б' синф рахбари.\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 1995 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*****. Уяли алоқа воситаси:+99898*******\n\n")


ui.pushButton.clicked.connect(bp)


def bp():
    ui.textEdit.setText("Хаммага Салом. Биз Python3 дастурлаш тили орқали хамма корхона, ташкилот ва ўқув"
                        " муассасаларига енгиллик яратиш мақсадида ва маълумотларни саноқли дақиқаларда олиш "
                        "имкониятига эга электрон маълумотлар базасини яратдик. Агар Сизларни ушбу яратилган лойиха"
                        " қизиқтирса, электрон манзилимизга алоқага чиқишингиз мумкин. Эътиборингиз учун рахмат. ")


ui.pushButton_10.clicked.connect(bp)


def bp():
    ui.textEdit.setText("Привет всем. Мы создали электронную базу данных. Если вам понравился этот созданный проект"
                        " и вы заинтересованы, вы можете связаться с нами по нашему адресу электронной почты. Спасибо"
                        " за ваше внимание.")


ui.pushButton_16.clicked.connect(bp)


def bp():
    ui.textEdit.setText("2 'a' синф ўқувчилари тўғрисида маълумот.\n\n"
                        "1. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "3. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "4. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "5. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "6. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n")


ui.pushButton_6.clicked.connect(bp)


def bp():
    ui.textEdit.setText("101 Yongin o'chirish hizmati.\n102 Police.\n103 Tez yordam.")


ui.pushButton_28.clicked.connect(bp)


def bp():
    ui.textEdit.setText("2 'а' синф рахбари.\n\n"   
                        "1. Хасанова Салима Абдуллаевна. Туғилган йили 1988 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n2 'б' синф рахбари.\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 1995 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*****. Уяли алоқа воситаси:+99898*******\n\n")


ui.pushButton_4.clicked.connect(bp)


def bp():
    ui.textEdit.setText("2 'б' синф ўқувчилари тўғрисида маълумот.\n\n"
                        "1. Дониёрова Салима Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "2. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "3. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "4. Aбдуллаева Азиза Каримовна. Туғилган йили 2005 йил 16 сентябрь. Манзили: Чилонзор 6 15 29"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "5. Aбдуллаев Тохир Мухторович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n"
                        "6. Иноғомов Салим Тоирович. Туғилган йили 2005 йил 2 сентябрь. Манзили: Чилонзор 7 21 36"
                        " Телефон уй рақами +99871*******. Уяли алоқа воситаси:+99898*******\n\n")


ui.pushButton_5.clicked.connect(bp)


def bp():
    ui.textEdit.setText("Юқорида келтирилган Фамилия Исм Шарифлари мисол тариқасида келтирилган.\n Бу программа орқали"
                        " хамма керакли маълумотларни тезкорлик билан олиш имконияти яралади.\nСенсор экранли"
                        " мониторлар орқали маълумот олиш хам мумкун, фақат Windows10 платформасига уланган бўлиши"
                        " керак.\nУшбу программани Сиз хохлаган рангда, хажм(размер)да ва хар хил тилларда тайёрлаш"
                        " имкони мавжуд бўлиб, маълумотлар ўчиб кетмайди.\nАгар Сизни ушбу лойиха қизиқтирса "
                        "worldismineok@gmail.com электрон манзилига ўз таклифларингизни ёзиб  қолдиринг.\n"
                        " Эътибингиз учун рахмат. ")


ui.pushButton_25.clicked.connect(bp)


sys.exit(app.exec_())
